404coffeenotfound-lge/kraken-os/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Bluetooth - BLE only (ESP32S3 supports BLE)

# WiFi - Disable all WPA3 features
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=n
CONFIG_ESP_WIFI_SOFTAP_SAE_SUPPORT=n
CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA=n
CONFIG_WPA_SUITE_B_192=n
CONFIG_WPA_11KV_SUPPORT=n
CONFIG_WPA_MBO_SUPPORT=n
CONFIG_WPA_11R_SUPPORT=n

# WiFi - Reduced buffers for SRAM savings
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=3
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=6
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=0
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=6
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=16

# PSRAM - Strategy: Explicit allocation for apps, SRAM reserved for system
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# Use CAPS allocator - apps must explicitly request PSRAM via heap_caps_malloc
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
# Allow BSS in PSRAM for app static buffers (use EXT_RAM_BSS_ATTR)
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
# Reserve minimum SRAM for system services (keep critical services fast)
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
# Keep WiFi/LWIP in SRAM for performance (system service)
# CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP is not set

# Memory optimizations - Move stacks and large buffers to PSRAM
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=3072
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_FREERTOS_IDLE_TASK_STACK_SIZE=1536

# Memory optimizations
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_FREERTOS_PLACE_SNAPSHOT_FUNS_INTO_FLASH=y
CONFIG_LWIP_IRAM_OPTIMIZATION=n

# Size optimization
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# LVGL Display Settings - Clean and sharp
CONFIG_LV_DPI_DEF=100
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y
# Disable subpixel rendering
# CONFIG_LV_FONT_SUBPX is not set
# Color settings
CONFIG_LV_COLOR_16_SWAP=n
# Enable execution from PSRAM (required for dynamic apps)
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_INSTRUCTION_CACHE_SIZE=16384

# Move code to flash to free IRAM for dynamic apps
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_SPI_FLASH_ROM_IMPL=y
CONFIG_BOOTLOADER_RESERVE_RTC_SIZE=0
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# Additional SRAM optimizations
CONFIG_LWIP_IRAM_OPTIMIZATION=n
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5744
CONFIG_LWIP_TCP_WND_DEFAULT=5744
CONFIG_LWIP_TCP_RECVMBOX_SIZE=6
CONFIG_LWIP_UDP_RECVMBOX_SIZE=6
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=8
# Bluetooth Configuration - Optimized for BLE only
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_GATTS_ENABLE=y
CONFIG_BT_GATT_MAX_SR_PROFILES=4
CONFIG_BT_GATT_MAX_SR_ATTRIBUTES=50
CONFIG_BLE_ADV_REPORT_FLOW_CTRL_SUPP=y
CONFIG_BLE_ADV_REPORT_FLOW_CTRL_NUM=50
CONFIG_BT_ACL_CONNECTIONS=2
# Enable BLE 4.2 advertising (required for esp_ble_gap_start_advertising)
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
# Reduce BLE memory usage
CONFIG_BT_BLE_DYNAMIC_ENV_MEMORY=y
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y

# Bluetooth controller
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=n
CONFIG_BTDM_CTRL_MODE_BTDM=n

# Bluetooth stack
CONFIG_BT_STACK_NO_LOG=n
CONFIG_BT_LOG_HCI_TRACE_LEVEL_WARNING=y

# System Service configuration - Reduced for SRAM savings
CONFIG_SYSTEM_SERVICE_MAX_SERVICES=12
CONFIG_SYSTEM_SERVICE_MAX_EVENT_TYPES=64
CONFIG_SYSTEM_SERVICE_MAX_SUBSCRIBERS=24
CONFIG_SYSTEM_SERVICE_MAX_DATA_SIZE=512
CONFIG_SYSTEM_SERVICE_LOW_PRIORITY_QUEUE_SIZE=8
CONFIG_SYSTEM_SERVICE_NORMAL_PRIORITY_QUEUE_SIZE=16
CONFIG_SYSTEM_SERVICE_HIGH_PRIORITY_QUEUE_SIZE=8
CONFIG_SYSTEM_SERVICE_CRITICAL_PRIORITY_QUEUE_SIZE=4
